### Programming for Data Analysis Project 1

INTRODUCTION  

For this project we chose Quality of Life dataset by O.Karaman retreived from Kaggle platform.[[1]](https://www.kaggle.com/datasets/orhankaramancode/city-quality-of-life-dataset) Data were acquired from Teleport.org and contain scores on different variables about the life in the cities around the world allowing the users to compare them in order to ease the decision of choosing a place to live. [[2]](https://teleport.org/about-us/)    

To simplify the analysis, we will not be using the entire dataset, instead we are going to pick some of the variables we find the most interesting and explore the relationship between them. (add more here)

### Exploring Data

Even though the data were already pre-processed, since we are not going to use the whole dataset, we will do additional cleaning but first, we are going to take a look at the data as we retrieved them. They are uploaded in csv format as scoresData.csv.

In [1]:
# We are using pandas library to read data from the file

In [2]:
import pandas as pd

In [3]:
scores = pd.read_csv('scoresData.csv')

To see the first couple of rows we are using the head() function.   
We have 21 columns of which the first one shows indexes of rows, next three are Name (of the cities), Country and Continent for which the scores in the variables are shown.

In [4]:
scores.head()

,Unnamed: 0,UA_Name,UA_Country,UA_Continent,Housing,Cost of Living,Startups,Venture Capital,Travel Connectivity,Commute,...,Safety,Healthcare,Education,Environmental Quality,Economy,Taxation,Internet Access,Leisure & Culture,Tolerance,Outdoors
0,0,Aarhus,Denmark,Europe,6.1315,4.015,2.8270,2.512,3.5360,6.31175,...,9.6165,8.704333,5.3665,7.63300,4.8865,5.0680,8.373,3.1870,9.7385,4.1300
1,1,Adelaide,Australia,Oceania,6.3095,4.692,3.1365,2.640,1.7765,5.33625,...,7.9260,7.936667,5.1420,8.33075,6.0695,4.5885,4.341,4.3285,7.8220,5.5310
2,2,Albuquerque,New Mexico,North America,7.2620,6.059,3.7720,1.493,1.4555,5.05575,...,1.3435,6.430000,4.1520,7.31950,6.5145,4.3460,5.396,4.8900,7.0285,3.5155
3,3,Almaty,Kazakhstan,Asia,9.2820,9.333,2.4585,0.000,4.5920,5.87125,...,7.3090,4.545667,2.2830,3.85675,5.2690,8.5220,2.886,2.9370,6.5395,5.5000
4,4,Amsterdam,Netherlands,Europe,3.0530,3.824,7.9715,6.107,8.3245,6.11850,...,8.5035,7.907333,6.1800,7.59725,5.0530,4.9550,4.523,8.8740,8.3680,5.3070

Types of data in the dataframe are checked with the info() function. Scores for variables such as Housing, Cost of Living, Startups and the rest are float data type while categorial variables: Name (of the city), Country and Continent have object data types.  
According to the output none of the entries are null, there are no missing values, although, just by looking at data we can see zeroes are included. Since we are not going to use the entire dataset, we will deal with zeroes later, after we pick the variables for analysis.

In [5]:
scores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 266 entries, 0 to 265
Data columns (total 21 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Unnamed: 0             266 non-null    int64
 1   UA_Name                266 non-null    object
 2   UA_Country             266 non-null    object
 3   UA_Continent           266 non-null    object
 4   Housing                266 non-null    float64
 5   Cost of Living         266 non-null    float64
 6   Startups               266 non-null    float64
 7   Venture Capital        266 non-null    float64
 8   Travel Connectivity    266 non-null    float64
 9   Commute                266 non-null    float64
 10  Business Freedom       266 non-null    float64
 11  Safety                 266 non-null    float64
 12  Healthcare             266 non-null    float64
 13  Education              266 non-null    float64
 14  Environmental Quality  266 non-null    float64
 15  Economy                266 non-null    float64
 16  Taxation               266 non-null    float64
 17  Internet Access        266 non-null    float64
 18  Leisure & Culture      266 non-null    float64
 19  Tolerance              266 non-null    float64
 20  Outdoors               266 non-null    float64
dtypes: float64(17), int64(1), object(3)
memory usage: 43.8+ KB

### Data Cleaning

After exploring the ways of how to remove columns we don't want in a dataset, it was decided we are going to drop them by indexes.

In [6]:
# axis=1 because we are taking out columns, for rows would be axis=0
scores2 = scores.drop(scores.columns[[0, 4, 5, 7, 8, 9, 12, 14, 16, 17, 18]], axis=1)
scores2

,UA_Name,UA_Country,UA_Continent,Startups,Business Freedom,Safety,Education,Economy,Tolerance,Outdoors
0,Aarhus,Denmark,Europe,2.8270,9.940000,9.6165,5.3665,4.8865,9.7385,4.1300
1,Adelaide,Australia,Oceania,3.1365,9.399667,7.9260,5.1420,6.0695,7.8220,5.5310
2,Albuquerque,New Mexico,North America,3.7720,8.671000,1.3435,4.1520,6.5145,7.0285,3.5155
3,Almaty,Kazakhstan,Asia,2.4585,5.568000,7.3090,2.2830,5.2690,6.5395,5.5000
4,Amsterdam,Netherlands,Europe,7.9715,8.836667,8.5035,6.1800,5.0530,8.3680,5.3070
...,...,...,...,...,...,...,...,...,...,...
261,Winnipeg,Canada,North America,3.7965,8.966000,6.0155,5.3440,5.8405,6.6590,4.2430
262,Wroclaw,Poland,Europe,3.5860,5.704333,8.1655,4.1615,4.7615,3.9045,4.0850
263,Yerevan,Armenia,Asia,3.9265,6.501000,8.8730,0.0000,3.4580,7.3465,7.7765
264,Zagreb,Croatia,Europe,4.4530,5.720333,8.6575,3.2110,2.2365,7.9545,4.8090
265,Zurich,Switzerland,Europe,6.2035,8.888000,9.0665,7.2875,6.5520,8.7845,5.4010

In [7]:
# Variables Startups and Outdoors were left to show we can also delete columns through turning headers into a list 
scoreslist = scores2.columns.tolist()
print(*scoreslist, sep = ", ")

UA_Name, UA_Country, UA_Continent, Startups, Business Freedom, Safety, Education, Economy, Tolerance, Outdoors

In [12]:
listdrop = ['Startups', 'Outdoors']
scoresnew = scores2.drop(listdrop, axis=1)
scoresnew

,UA_Name,UA_Country,UA_Continent,Business Freedom,Safety,Education,Economy,Tolerance
0,Aarhus,Denmark,Europe,9.940000,9.6165,5.3665,4.8865,9.7385
1,Adelaide,Australia,Oceania,9.399667,7.9260,5.1420,6.0695,7.8220
2,Albuquerque,New Mexico,North America,8.671000,1.3435,4.1520,6.5145,7.0285
3,Almaty,Kazakhstan,Asia,5.568000,7.3090,2.2830,5.2690,6.5395
4,Amsterdam,Netherlands,Europe,8.836667,8.5035,6.1800,5.0530,8.3680
...,...,...,...,...,...,...,...,...
261,Winnipeg,Canada,North America,8.966000,6.0155,5.3440,5.8405,6.6590
262,Wroclaw,Poland,Europe,5.704333,8.1655,4.1615,4.7615,3.9045
263,Yerevan,Armenia,Asia,6.501000,8.8730,0.0000,3.4580,7.3465
264,Zagreb,Croatia,Europe,5.720333,8.6575,3.2110,2.2365,7.9545
265,Zurich,Switzerland,Europe,8.888000,9.0665,7.2875,6.5520,8.7845

To make a dataframe look nicer we changed the names of the variables

In [13]:
scoresnew.rename(columns={"UA_Name": "City", "UA_Country": "Country", "UA_Continent": "Continent"})

,City,Country,Continent,Business Freedom,Safety,Education,Economy,Tolerance
0,Aarhus,Denmark,Europe,9.940000,9.6165,5.3665,4.8865,9.7385
1,Adelaide,Australia,Oceania,9.399667,7.9260,5.1420,6.0695,7.8220
2,Albuquerque,New Mexico,North America,8.671000,1.3435,4.1520,6.5145,7.0285
3,Almaty,Kazakhstan,Asia,5.568000,7.3090,2.2830,5.2690,6.5395
4,Amsterdam,Netherlands,Europe,8.836667,8.5035,6.1800,5.0530,8.3680
...,...,...,...,...,...,...,...,...
261,Winnipeg,Canada,North America,8.966000,6.0155,5.3440,5.8405,6.6590
262,Wroclaw,Poland,Europe,5.704333,8.1655,4.1615,4.7615,3.9045
263,Yerevan,Armenia,Asia,6.501000,8.8730,0.0000,3.4580,7.3465
264,Zagreb,Croatia,Europe,5.720333,8.6575,3.2110,2.2365,7.9545
265,Zurich,Switzerland,Europe,8.888000,9.0665,7.2875,6.5520,8.7845

References:  
    [1]: Karaman, O. (n.d.). City Quality of Life Dataset., Version 1, Retreived November 24, 2022 from https://www.kaggle.com/datasets/orhankaramancode/city-quality-of-life-dataset  
    [2]: Teleport, (n.d). About us, Retreived November 24, 2022 from https://teleport.org/about-us/

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html    
https://stackoverflow.com/questions/19482970/get-a-list-from-pandas-dataframe-column-headers  
https://www.geeksforgeeks.org/print-lists-in-python-4-different-ways/  
https://sparkbyexamples.com/pandas/pandas-drop-columns-examples/